[
  {
    "id": "6328575b-ab87-4617-8e4c-aae8b5d6aa45",
    "name": "Капитанская дочь",
    "description": "Исторический роман (или повесть) Александра Сергеевича Пушкина, действие которого происходит во время восстания Емельяна Пугачёва. Впервые был опубликован без указания имени автора в 4-й книжке журнала «Современник» в 1836 году.",
    "price": 300,
    "category": "художественное",
    "author": "Александр Сергеевич Пушкин",
    "quantity": 1,
    "image": "https://cdn1.ozone.ru/s3/multimedia-1-2/7220524178.jpg",
    "ownerId": "7kWODYao9oSk8abgZWiXAJyWZOc2",
    "createdAt": "2025-08-09T17:53:06.887Z",
    "updatedAt": "2025-09-06T21:28:30.772Z",
    "source": "local",
    "googleVolumeId": null
  },
  {
    "id": "7b8293cd-3f73-4b87-8730-af99e7a7bb19",
    "name": "Судьба человека",
    "description": "Рассказ М. А. Шолохова, основанный на реальных событиях. Произведение рассказывает о жизни человека, который пережил многое во время Великой Отечественной войны.",
    "price": 450,
    "category": "художественное",
    "author": "Михаил Александрович Шолохов",
    "quantity": 1,
    "image": "https://i.ytimg.com/vi/4pCT1JhZB_4/maxresdefault.jpg",
    "ownerId": "7kWODYao9oSk8abgZWiXAJyWZOc2",
    "createdAt": "2025-08-09T18:00:33.414Z",
    "updatedAt": "2025-09-06T21:32:24.491Z",
    "source": "local",
    "googleVolumeId": null
  },
  {
    "id": "92250890-baee-4bee-864f-4f5fe50748e5",
    "name": "Война и мир",
    "description": "Показать, что произошло с русским народом в условиях кризиса, вызванного Отечественной войной 1812 года. Лев Толстой затрагивает в своём произведении множество важных тем: любовь, семья, война, жизнь и смерть, человеческие ценности и социальные перемены.",
    "price": 500,
    "category": "художественное",
    "author": "Лев Николаевич Толстой",
    "quantity": 5,
    "image": "https://avatars.dzeninfra.ru/get-zen_doc/271828/pub_67f01b19a93b5769a01d5365_67f01cafef681429c146b5d9/scale_1200",
    "ownerId": "7kWODYao9oSk8abgZWiXAJyWZOc2",
    "createdAt": "2025-08-11T11:23:27.073Z",
    "updatedAt": "2025-09-06T21:45:13.839Z",
    "source": "local",
    "googleVolumeId": null
  },
  {
    "id": "c8174cb6-d672-4926-831d-4c6b820e9419",
    "name": "«Когнитивные системы управления эффективностью бизнеса»",
    "description": "учебник и практикум для вузов",
    "price": 455,
    "category": "информационное",
    "author": "Б. Е. Одинцов",
    "quantity": 4,
    "image": "",
    "ownerId": "7kWODYao9oSk8abgZWiXAJyWZOc2",
    "createdAt": "2025-08-11T11:23:37.044Z",
    "updatedAt": "2025-09-06T21:46:47.429Z",
    "source": "local",
    "googleVolumeId": null
  },
  {
    "id": "0966d869-e918-44ef-837d-a4f5f886f7a4",
    "name": "Краткая история времени",
    "description": "Научно-популярная книга Стивена Хокинга, которая рассказывает о развитии и истории космологии от Древней Греции до 1980-х годов.",
    "price": 535,
    "category": "научно-популярное",
    "author": "Стивена Хокинга",
    "quantity": 4,
    "image": "https://ir.ozone.ru/s3/multimedia-4/c1000/6815652664.jpg",
    "ownerId": "7kWODYao9oSk8abgZWiXAJyWZOc2",
    "createdAt": "2025-08-11T11:23:48.714Z",
    "updatedAt": "2025-09-06T21:37:22.677Z",
    "source": "local",
    "googleVolumeId": null
  },
  {
    "id": "5d7cf320-e429-45f3-8649-fea40982cd4b",
    "name": "«Гамлет, принц датский»",
    "description": "Одна из самых известных его пьес и одна из самых знаменитых пьес в мировой драматургии.",
    "price": 1200,
    "category": "практическое",
    "author": "Уильяма Шекспира",
    "quantity": 40,
    "image": "https://s1.livelib.ru/boocover/1000219045/200x305/438d/Vilyam_Shekspir__Gamlet_prints_Datskij_sbornik.jpg",
    "ownerId": "7kWODYao9oSk8abgZWiXAJyWZOc2",
    "createdAt": "2025-08-11T11:24:01.364Z",
    "updatedAt": "2025-09-06T21:49:19.531Z",
    "source": "local",
    "googleVolumeId": null
  },
  {
    "id": "6beb539c-a466-4c51-8506-38c92a36df21",
    "name": "Крошечные травмы",
    "description": "Арролл исследует влияние крошечных травм (КТ) — не катастрофических событий, а микроповреждений, которые накапливаются в повседневности.",
    "price": 700,
    "category": "научное",
    "author": "Мег Арролл",
    "quantity": 5,
    "image": "https://avatars.mds.yandex.net/get-mpic/9737239/2a0000018bcd3ba6d39d5f17a408c92a4f42/orig",
    "ownerId": "7kWODYao9oSk8abgZWiXAJyWZOc2",
    "createdAt": "2025-08-11T13:28:39.211Z",
    "updatedAt": "2025-09-06T21:41:17.296Z",
    "source": "local",
    "googleVolumeId": null
  },
  {
    "id": "ab4a7707-ed85-47ec-a9a9-c6cddc6d429d",
    "name": "«Теория рекламы»",
    "description": "Предлагает взгляд на рекламу через призму теории разрыва: для создания успешной рекламы необходимо нарушать устоявшиеся правила и искать новые подходы. В книге рассматриваются вопросы инноваций и креативности, стратегического планирования и управления рекламными кампаниями.",
    "price": 400,
    "category": "рекламное",
    "author": "Жан-Мари Дрю",
    "quantity": 3,
    "image": "https://shop-re-books.ru/upload/iblock/bb6/acbfhq3d01viviwii0rcodpcci0esbbj/f2f99278_29ca_11f0_a7a9_00155d08020a_61a93bb9_2c0f_11f0_a7a9_00155d08020a.resize1.jpg",
    "ownerId": "7kWODYao9oSk8abgZWiXAJyWZOc2",
    "createdAt": "2025-08-12T11:25:07.991Z",
    "updatedAt": "2025-09-06T21:43:02.789Z",
    "source": "local",
    "googleVolumeId": null
  },
  {
    "id": "53c74313-49e1-4524-9fbc-2498e1b75e5a",
    "name": "кпе",
    "description": "керке",
    "price": 243,
    "category": "научно-популярное",
    "author": "вап",
    "quantity": 5,
    "image": "",
    "ownerId": "aDZ78l7SuQReevNZwFy8fXEbQhm2",
    "createdAt": "2025-08-12T11:26:01.709Z",
    "updatedAt": "2025-08-12T11:26:01.709Z"
  },
  {
    "id": "48802462-0123-46c8-9e93-8c365a6cebd5",
    "name": "«Эмоциональная смелость»",
    "description": "кенке",
    "price": 800,
    "category": "практическое",
    "author": "Питер Брегман",
    "quantity": 5,
    "image": "https://main-cdn.sbermegamarket.ru/big1/hlr-system/15397251223/100025770721b0.jpg",
    "ownerId": "7kWODYao9oSk8abgZWiXAJyWZOc2",
    "createdAt": "2025-08-12T11:56:29.369Z",
    "updatedAt": "2025-09-06T21:47:41.136Z",
    "source": "local",
    "googleVolumeId": null
  },
  {
    "id": "d1cb26d9-6e11-467a-a3ac-a46bc7b06fa0",
    "name": "«Гибель империи. Российский урок»",
    "description": "Исследование, которое погружает читателя в трагические события, приведшие к падению Российской империи. Автор, опираясь на обширный массив научных источников, раскрывает детали Февральской революции 1917 года и анализирует механизмы, способствовавшие катастрофическим изменениям в стране.",
    "price": 500,
    "category": "для досуга",
    "author": "Тихон Шевкунов",
    "quantity": 5,
    "image": "https://avatars.mds.yandex.net/i?id=893c6768f51e13f3863239afdcdb3058_l-5234784-images-thumbs&n=13",
    "ownerId": "7kWODYao9oSk8abgZWiXAJyWZOc2",
    "createdAt": "2025-08-12T15:07:07.778Z",
    "updatedAt": "2025-09-06T21:45:09.011Z",
    "source": "local",
    "googleVolumeId": null
  },
  {
    "id": "ee4033da-9d2b-4143-9218-ac4dcc842c20",
    "name": "Oliver Twist",
    "description": "JAICO ILLUSTARTED CLASSICS SERIES is a collection of beloved children’s classics read by generations all over the world. Rich with adventures and thrills, these immortal stories with vivid illustrations are designed to delight young readers. IN A RAMSHACKLE workhouse of a parish in England, a baby boy was born to a woman who died in childbirth. The boy was named OLIVER TWIST. He spent a sad childhood in abject misery in various workhouses. At the age of twelve, he runs away to London where he is picked up by a notorious criminal, Fagin, a mastermind at house breaking, pickpocketing and petty thievery. He teaches Oliver all these evil deeds. But a kind-hearted gentleman robbed by Fagin sympathizes with the plight of Oliver and helps him to find a family, his inheritance and above all Oliver’s true identity. CHARLES DICKENS was born in a little house in Landport, Portsea, England. The second of eight children, he grew up in a family frequently beset by financial insecurity. When the family fortunes improved, Dickens went back to school, after which he became an office boy, a freelance reporter, and finally an author.",
    "price": 85.07,
    "category": "Fiction",
    "author": "Charles Dickens",
    "quantity": 7,
    "image": "https://books.google.com/books/content?id=3oSqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "3oSqDwAAQBAJ",
    "createdAt": "2025-08-27T17:28:38.755Z",
    "updatedAt": "2025-08-27T17:28:38.755Z"
  },
  {
    "id": "4dd49db9-47b4-482a-9243-04cec4041184",
    "name": "The Picture of Dorian Gray",
    "description": "The Picture of Dorian Gray is the only published novel by Oscar Wilde, appearing as the lead story in Lippincott's Monthly Magazine on 20 June 1890, printed as the July 1890 issue. The magazine's editors feared the story was indecent as submitted, so they censored roughly 500 words, without Wilde's knowledge, before publication. But even with that, the story was still greeted with outrage by British reviewers, some of whom suggested that Wilde should be prosecuted on moral grounds, leading Wilde to defend the novel aggressively in letters to the British press. Today, Wilde's fin de siècle novella is considered a classic. This new edition from Immortal Books includes footnotes and images.",
    "price": 784,
    "category": "Fiction",
    "author": "Oscar Wilde",
    "quantity": 10,
    "image": "https://books.google.com/books/content?id=6vGiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "6vGiDwAAQBAJ",
    "createdAt": "2025-08-27T17:28:38.755Z",
    "updatedAt": "2025-08-27T17:28:38.755Z"
  },
  {
    "id": "23994b5e-1296-4e22-9b6f-8fadbc0c0f7f",
    "name": "Frankenstein",
    "description": "Mary Shelley's 'Frankenstein' is a groundbreaking work of gothic literature that explores themes of ambition, isolation, and the consequences of playing god. Written in an epistolary format, the reader is drawn into the chilling tale of Victor Frankenstein and his creation, the monster. Shelley's descriptive prose and use of multiple narrators create a sense of foreboding and unease, making 'Frankenstein' a timeless classic in the literary canon. The novel also raises ethical questions about scientific responsibility and the limits of human knowledge, making it a thought-provoking read for modern audiences. Mary Shelley's personal experiences, including the death of her own children and her tumultuous relationship with Percy Bysshe Shelley, undoubtedly influenced the creation of 'Frankenstein.' Her unique perspective as a female author in the 19th century adds layers of depth to the story, highlighting the societal expectations and constraints faced by women of her time. I highly recommend 'Frankenstein' to readers who enjoy thought-provoking literature that delves into the darker aspects of human nature and morality.",
    "price": 99,
    "category": "Fiction",
    "author": "Mary Shelley",
    "quantity": 14,
    "image": "https://books.google.com/books/content?id=9zfmEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "9zfmEAAAQBAJ",
    "createdAt": "2025-08-27T17:28:38.755Z",
    "updatedAt": "2025-08-27T17:28:38.755Z"
  },
  {
    "id": "91157d81-dd48-452e-991d-a41f670ef253",
    "name": "Father Goriot",
    "description": "Le Père Goriot (\"Old Goriot\" or \"Father Goriot\") is an 1835 novel by French novelist and playwright Honoré de Balzac (1799-1850), included in the Scènes de la vie privée section of his novel sequence La Comédie humaine. Set in Paris in 1819, it follows the intertwined lives of three characters: the elderly doting Goriot, a mysterious criminal-in-hiding named Vautrin and a naive law student named Eugène de Rastignac. Originally published in serial form during the winter of 1834-1835, Le Père Goriot is widely considered Balzac's most important novel. It marks the first serious use by the author of characters who had appeared in other books, a technique that distinguishes Balzac's fiction. The novel is also noted as an example of his realist style, using minute details to create character and subtext. The novel takes place during the Bourbon Restoration, which brought profound changes to French society; the struggle by individuals to secure a higher social status is a major theme in the book. The city of Paris also impresses itself on the characters - especially young Rastignac, who grew up in the provinces of southern France. Balzac analyzes, through Goriot and others, the nature of family and marriage, providing a pessimistic view of these institutions. The novel was released to mixed reviews. Some critics praised the author for his complex characters and attention to detail; others condemned him for his many depictions of corruption and greed. A favorite of Balzac's, the book quickly won widespread popularity and has often been adapted for film and the stage. It gave rise to the French expression \"Rastignac\", a social climber willing to use any means to better his situation. (wikipedia.org) About the author: Honoré de Balzac born Honoré Balzac; (20 May 1799 - 18 August 1850) was a French novelist and playwright. The novel sequence La Comédie humaine, which presents a panorama of post-Napoleonic French life, is generally viewed as his magnum opus. Owing to his keen observation of detail and unfiltered representation of society, Balzac is regarded as one of the founders of realism in European literature. He is renowned for his multi-faceted characters; even his lesser characters are complex, morally ambiguous and fully human. Inanimate objects are imbued with character as well; the city of Paris, a backdrop for much of his writing, takes on many human qualities. His writing influenced many famous writers, including the novelists Émile Zola, Charles Dickens, Marcel Proust, Gustave Flaubert, and Henry James, and filmmakers François Truffaut and Jacques Rivette. Many of Balzac's works have been made into films and continue to inspire other writers. James called him \"really the father of us all.\" An enthusiastic reader and independent thinker as a child, Balzac had trouble adapting to the teaching style of his grammar school. His willful nature caused trouble throughout his life and frustrated his ambitions to succeed in the world of business. When he finished school, Balzac was apprenticed in a law office, but he turned his back on the study of law after wearying of its inhumanity and banal routine. Before and during his career as a writer, he attempted to be a publisher, printer, businessman, critic, and politician; he failed in all of these efforts. La Comédie Humaine reflects his real-life difficulties, and includes scenes from his own experience. Balzac suffered from health problems throughout his life, possibly owing to his intense writing schedule. His relationship with his family was often strained by financial and personal drama, and he lost more than one friend over critical reviews. In 1850, Balzac married Ewelina Hańska (née Contessa Rzewuska), a Polish aristocrat and his longtime love. He died in Paris six months later. (wikipedia.org)",
    "price": 1419,
    "category": "Books",
    "author": "Honoré de Balzac",
    "quantity": 10,
    "image": "https://books.google.com/books/content?id=A2Ni0AEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "A2Ni0AEACAAJ",
    "createdAt": "2025-08-27T17:28:38.755Z",
    "updatedAt": "2025-08-27T17:28:38.755Z"
  },
  {
    "id": "18393299-39c0-42af-b72f-f505687402d8",
    "name": "Irresistible",
    "description": "En un mundo de apariencias, estaba dispuesta a arriesgarlo todo por una noche de amor. Novela ganadora del premio Romantic Times. Soltera y todavía virgen, la novelista Amanda Briars no está dispuesta a recibir su trigésimo cumpleaños sin haber hecho el amor. Cuando Jack Devlin llama a su puerta, cree que se trata del regalo que se ha hecho a sí misma: un hombre contratado para una noche de pasión. Aunque algo impide a Jack dar rienda suelta al deseo, su determinación de poseer a Amanda no se detendrá... Pero ella ansía la respetabilidad más de lo que está dispuesta a admitir mientras que Jack se niega a vivir conforme a las reglas de la sociedad victoriana. Sus respectivos mundos colisionarán con una pasión que ninguno de los dos esperaba...",
    "price": 700,
    "category": "Fiction",
    "author": "Lisa Kleypas",
    "quantity": 13,
    "image": "https://books.google.com/books/content?id=AqY4AwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "AqY4AwAAQBAJ",
    "createdAt": "2025-08-27T17:28:38.755Z",
    "updatedAt": "2025-08-27T17:28:38.755Z"
  },
  {
    "id": "573eea1f-7516-4fcf-8aa5-9f8e0cb96e51",
    "name": "How I Found Livingstone",
    "description": "Reprint of the original, first published in 1872. The publishing house Anatiposi publishes historical books as reprints. Due to their age, these books may have missing pages or inferior quality. Our aim is to preserve these books and make them available to the public so that they do not get lost.",
    "price": 1231,
    "category": "Fiction",
    "author": "Henry M. Stanley",
    "quantity": 7,
    "image": "https://books.google.com/books/content?id=D32yEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "D32yEAAAQBAJ",
    "createdAt": "2025-08-27T17:28:38.755Z",
    "updatedAt": "2025-08-27T17:28:38.755Z"
  },
  {
    "id": "e1cde53f-bc10-45a9-90a4-c7bcd8f03bcb",
    "name": "Remembered Death",
    "description": "Rosemary took a glass of champagne and died--was it suicide? The six guests begin to remember things and the killer strikes again.",
    "price": 751,
    "category": "Detective and mystery stories",
    "author": "Agatha Christie",
    "quantity": 9,
    "image": "",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "D5i5wgEACAAJ",
    "createdAt": "2025-08-27T17:28:38.755Z",
    "updatedAt": "2025-08-27T17:28:38.755Z"
  },
  {
    "id": "c19bd709-1451-4c4a-b18b-42daf4b7ad98",
    "name": "The Black Arrow",
    "description": "From the beloved author of Treasure Island Originally serialized in a periodical of boys' adventure fiction, The Black Arrow is a swashbuckling portrait of a young man's journey to discover the heroism within himself. Young Dick Shelton, caught in the midst of England's War of the Roses, finds his loyalties torn between the guardian who will ultimately betray him and the leader of a secret fellowship, The Black Arrow. As Shelton is drawn deeper into this conspiracy, he must distinguish friend from foe and confront war, shipwreck, revenge, murder, and forbidden love, as England's crown threatens to topple around him. For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
    "price": 1078,
    "category": "Fiction",
    "author": "Robert Louis Stevenson",
    "quantity": 23,
    "image": "https://books.google.com/books/content?id=J4-MEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "J4-MEAAAQBAJ",
    "createdAt": "2025-08-27T17:28:38.755Z",
    "updatedAt": "2025-08-27T17:28:38.755Z"
  },
  {
    "id": "c9ceaaa9-48de-41a2-ac78-ad4db0bdf490",
    "name": "Little Black Sambo",
    "description": "The Story of Little Black Sambo is a children's book written and illustrated by Scottish author Helen Bannerman, and first published by Grant Richards in October 1899 as one in a series of small-format books called The Dumpy Books for Children. The story was a children's favorite for more than half a century but would become a victim of allegations of racism in the mid-20th century. Critics of the time observed that Bannerman presents one of the first black heroes in children's literature and regarded the book as positively portraying black characters in both the text and pictures, especially in comparison to the more negative books of that era that depicted blacks as simple and uncivilized. Both text and illustrations have undergone considerable revision since.",
    "price": 99,
    "category": "Fiction",
    "author": "Helen Bannerman",
    "quantity": 15,
    "image": "https://books.google.com/books/content?id=JSOvEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "JSOvEAAAQBAJ",
    "createdAt": "2025-08-27T17:28:38.755Z",
    "updatedAt": "2025-08-27T17:28:38.755Z"
  },
  {
    "id": "bcb0864b-d120-4a33-b954-a5fa8d5ed07c",
    "name": "The Plague",
    "description": "“Its relevance lashes you across the face.” —Stephen Metcalf, The Los Angeles Times • “A redemptive book, one that wills the reader to believe, even in a time of despair.” —Roger Lowenstein, The Washington Post A haunting tale of human resilience and hope in the face of unrelieved horror, Albert Camus' iconic novel about an epidemic ravaging the people of a North African coastal town is a classic of twentieth-century literature. The townspeople of Oran are in the grip of a deadly plague, which condemns its victims to a swift and horrifying death. Fear, isolation and claustrophobia follow as they are forced into quarantine. Each person responds in their own way to the lethal disease: some resign themselves to fate, some seek blame, and a few, like Dr. Rieux, resist the terror. An immediate triumph when it was published in 1947, The Plague is in part an allegory of France's suffering under the Nazi occupation, and a timeless story of bravery and determination against the precariousness of human existence.",
    "price": 1259,
    "category": "Fiction",
    "author": "Albert Camus",
    "quantity": 11,
    "image": "https://books.google.com/books/content?id=KVGd-NabpW0C&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "KVGd-NabpW0C",
    "createdAt": "2025-08-27T17:28:38.755Z",
    "updatedAt": "2025-08-27T17:28:38.755Z"
  },
  {
    "id": "bc7ff441-cbac-4188-8db8-39deb9885367",
    "name": "SHERLOCK HOLMES - THE VALLEY OF FEAR",
    "description": "SHERLOCK HOLMES – THE VALLEY OF FEAR, is the 4th and final novel written by Arthur Conan Doyle. This book is complete, unabridged and was originally published in 1915. This is one of Doyle’s most outstanding and well-known works of the adventures of the most famous crime-solving duo - Sherlock Holmes and John Watson This book is properly formatted for aesthetics and ease of reading. This book is great for teachers and students or for the casual reader. This book is the perfect addition to any classic literary library. At Pure Snow Publishing we have taken the time and care into formatting this book to make it the best possible reading experience. Key features of this book: - A biographical outline of the author - A custom list of related collections and novels written by the author (listed in order of initial publication) - Easy-to-read font size: 12 pt. - Indented first lines, 1.25 Line Spacing and Justified Paragraphs - Custom Table of Contents and Design elements for each chapter - The Copyright page has been placed at the end of the book, as to not impede the content and flow of the book. We have made this book available in 3 reading formats: Original Paperback, Large Print Paperback and Ebook. Enjoy!",
    "price": 155.61,
    "category": "Fiction",
    "author": "ARTHUR CONAN DOYLE",
    "quantity": 20,
    "image": "https://books.google.com/books/content?id=L88qEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "L88qEAAAQBAJ",
    "createdAt": "2025-08-27T17:28:38.755Z",
    "updatedAt": "2025-08-27T17:28:38.755Z"
  },
  {
    "id": "b1bfc345-9014-4723-99fb-b9759b45c6c0",
    "name": "Mysteries",
    "description": "The first complete English translation of the Nobel Prize-winner’s literary masterpiece A Penguin Classic Mysteries is the story of Johan Nilsen Nagel, a mysterious stranger who suddenly turns up in a small Norwegian town one summer—and just as suddenly disappears. Nagel is a complete outsider, a sort of modern Christ treated in a spirit of near parody. He condemns the politics and thought of the age, brings comfort to the “insulted and injured,” and gains the love of two women suggestive of the biblical Mary and Martha. But there is a sinister side of him: in his vest he carries a vial of prussic acid... The novel creates a powerful sense of Nagel's stream of thought, as he increasingly withdraws into the torture chamber of his own subconscious psyche. For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,800 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
    "price": 702,
    "category": "Fiction",
    "author": "Knut Hamsun",
    "quantity": 20,
    "image": "https://books.google.com/books/content?id=MRoMUV2kLZEC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "MRoMUV2kLZEC",
    "createdAt": "2025-08-27T17:28:38.755Z",
    "updatedAt": "2025-08-27T17:28:38.755Z"
  },
  {
    "id": "19759e84-480b-496b-8f11-76c0c372813f",
    "name": "Mohini Theevu",
    "description": "Conversations turns into story telling of one’s lifetime experience of visiting a Island somewhere below the Sri Lanka. A Writer who forced to take a trip to India from Burma aka Myanmar due to outbreak of war. Unfortunately or fortunately he get to travel in a old crowded ship.Due to Fear of bombers captain of the ship takes them to near by island. Beauty of the island invites everyone to it but few along with captain travels to the island. Where captain explains his earlier visit to island and take them back to ship. But writer wish to spend some more time before the ship continues its voyage so he hide himself behind the trees. Captain and passengers takes the row boat and ride back to the ship. They realise they left someone behind but due to sunset they decide to stay back in ship till dawn. Writer revisit the spot he enjoyed few moments back and experience something strange events. How those strange events impact him? Did he able to return back to ship? What story is awaiting for the writer to tell his friends is all about the story.",
    "price": 78.2,
    "category": "Fiction",
    "author": "Kalki",
    "quantity": 24,
    "image": "https://books.google.com/books/content?id=MZyXEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "MZyXEAAAQBAJ",
    "createdAt": "2025-08-27T17:28:38.755Z",
    "updatedAt": "2025-08-27T17:28:38.755Z"
  },
  {
    "id": "d1abfa4c-3ead-4bad-8bde-181fc12c389a",
    "name": "Mrs. Dalloway",
    "description": "Heralded as Virginia Woolf's greatest novel, this is a vivid portrait of a single day in a woman's life. When we meet her, Mrs. Clarissa Dalloway is preoccupied with the last-minute details of party preparation while in her mind she is something much more than a perfect society hostess. As she readies her house, she is flooded with remembrances of faraway times. And, met with the realities of the present, Clarissa reexamines the choices that brought her there, hesitantly looking ahead to the unfamiliar work of growing old. \"Mrs. Dalloway was the first novel to split the atom. If the novel before Mrs. Dalloway aspired to immensities of scope and scale, to heroic journeys across vast landscapes, with Mrs. Dalloway Virginia Woolf insisted that it could also locate the enormous within the everyday; that a life of errands and party-giving was every bit as viable a subject as any life lived anywhere; and that should any human act in any novel seem unimportant, it has merely been inadequately observed. The novel asan art form has not been the same since. \"Mrs. Dalloway also contains some of the most beautiful, complex, incisive and idiosyncratic sentences ever written in English, and that alone would be reason enough to read it. It is one of the most moving, revolutionary artworks of the twentieth century.\" --Michael Cunningham, author of The Hours",
    "price": 1477,
    "category": "Fiction",
    "author": "Virginia Woolf",
    "quantity": 24,
    "image": "https://books.google.com/books/content?id=OqAFAQAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "OqAFAQAAIAAJ",
    "createdAt": "2025-08-27T17:28:38.755Z",
    "updatedAt": "2025-08-27T17:28:38.755Z"
  },
  {
    "id": "d7d29336-ad3e-4f4d-8117-e40478524b67",
    "name": "1601 Conversation as it was by the Social Fireside in the Time of the Tudors",
    "description": "1601 was written during the summer of 1876 when the Clemens family had retreated to Quarry Farm in Elmira County, New York. Here Mrs. Clemens enjoyed relief from social obligations, the children romped over the countryside, and Mark retired to his octagonal study, which, perched high on the hill, looked out upon the valley below. It was in the famous summer of 1876, too, that Mark was putting the finishing touches to Tom Sawyer. Before the close of the same year he had already begun work on ‘The Adventures of Huckleberry Finn’, published in 1885. It is interesting to note the use of the title, the “Duke of Bilgewater,” in Huck Finn when the “Duchess of Bilgewater” had already made her appearance in 1601. Sandwiched between his two great masterpieces, Tom Sawyer and Huck Finn, the writing of 1601 was indeed a strange interlude. During this prolific period Mark wrote many minor items, most of them rejected by Howells, and read extensively in one of his favorite books, Pepys’ Diary. Like many another writer Mark was captivated by Pepys’ style and spirit, and “he determined,” says Albert Bigelow Paine in his ‘Mark Twain, A Biography’, “to try his hand on an imaginary record of conversation and court manners of a bygone day, written in the phrase of the period. The result was ‘Fireside Conversation in the Time of Queen Elizabeth’, or as he later called it, ‘1601’. The ‘conversation’ recorded by a supposed Pepys of that period, was written with all the outspoken coarseness and nakedness of that rank day, when fireside sociabilities were limited only to the loosened fancy, vocabulary, and physical performance, and not by any bounds of convention.”",
    "price": 5000,
    "category": "Fiction",
    "author": "Mark Twain",
    "quantity": 24,
    "image": "https://books.google.com/books/content?id=QwVWCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "QwVWCgAAQBAJ",
    "createdAt": "2025-08-27T17:28:38.755Z",
    "updatedAt": "2025-08-27T17:28:38.755Z"
  },
  {
    "id": "e72cb50f-c7c0-4878-820f-3b66ad6fbeca",
    "name": "Pride and Prejudice Annotated",
    "description": "Along with the plays of William Shakespeare and the works of Charles Dickens, Jane Austen's novels are among the most beloved books of Western literature. Pride and Prejudice (1813) was in Austen's lifetime her most popular novel, and it was the author's personal favorite. Adapted many times to the screen and stage, and the inspiration for numerous imitations, it remains today her most widely read book. Now, in this beautifully illustrated and annotated edition, distinguished scholar Patricia Meyer Spacks instructs the reader in a larger appreciation of the novel's enduring pleasures and provides analysis of Darcy, Elizabeth Bennet, Lady Catherine, and all the characters who inhabit the world of Pride and Prejudice.",
    "price": 1322,
    "category": "Books",
    "author": "Jane Austen",
    "quantity": 8,
    "image": "https://books.google.com/books/content?id=TwVqzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "TwVqzgEACAAJ",
    "createdAt": "2025-08-27T17:28:38.755Z",
    "updatedAt": "2025-08-27T17:28:38.755Z"
  },
  {
    "id": "528a88cd-4c4c-4af5-81b6-d68a5e6857df",
    "name": "A Tourist Guide To Lancre",
    "description": "Not only an artistic and breathtaking view of Lancre but also an interesting and informative guide to one of the Discworld's more, er, picturesque kingdoms. Granny Weatherwax, Nanny Ogg and Magrat Garlick live there. Lancre could hardly be somwhere ordinary, could it? Magic glues the Discworld together and a lot of it ends up in Lancre, principal Kingdom of the Ramtop Mountains. Between Uberwald and Whale Bay, the Octarine Grass Country and the Windersins Ocean lies the most exciting and dangerous terrain in all Discworld. The Ramtops supply Discworld with most of its witches and wizards. The leaves on the trees move even when there is no breeze. Rocks go for a stroll in the evening. Even the land, at times, seems alive. The mapp may be only two-dimensional, but watch it very carefully and you might just see it jostle about a bit.",
    "price": 1826.19,
    "category": "Fiction",
    "author": "Stephen Briggs",
    "quantity": 15,
    "image": "https://books.google.com/books/content?id=UKDyDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "UKDyDwAAQBAJ",
    "createdAt": "2025-08-27T17:28:38.755Z",
    "updatedAt": "2025-08-27T17:28:38.755Z"
  },
  {
    "id": "e048fae0-9656-4574-92e8-7d4eaf185a76",
    "name": "The History of the Peloponnesian War",
    "description": "The History of the Peloponnesian War (Greek: Ἱστορίαι, \"Histories\") is a historical account of the Peloponnesian War (431–404 BC), which was fought between the Peloponnesian League (led by Sparta) and the Delian League (led by Athens). It was written by Thucydides, an Athenian historian who also served as an Athenian general during the war. His account of the conflict is widely considered to be a classic and regarded as one of the earliest scholarly works of history. The History is divided into eight books.",
    "price": 176.89,
    "category": "Fiction",
    "author": "Thucydides",
    "quantity": 16,
    "image": "https://books.google.com/books/content?id=UiRdEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "UiRdEQAAQBAJ",
    "createdAt": "2025-08-27T17:28:38.755Z",
    "updatedAt": "2025-08-27T17:28:38.756Z"
  },
  {
    "id": "c8f9bbd0-dc24-42bb-92a8-e162c4b2c746",
    "name": "Max Havelaar",
    "description": "Max Havelaar is a powerful critique of colonialism and social injustices, set against the backdrop of the Dutch colonial exploitation of the Javanese people. The narrative follows a coffee broker in Amsterdam, who offers a no-nonsense perspective on his profession, dismissing idealized notions of romance and poetry in favor of what he believes is practical and truthful business. As the story unfolds, the broker reflects on the moral corruption inherent in the coffee trade and begins to address the darker realities of colonial oppression. The novel explores the exploitation of indigenous labor, with a focus on the Javanese people s suffering under Dutch rule. It exposes the social and economic structures that perpetuate injustice, highlighting the personal and societal consequences of such systems. The novel offers a poignant examination of moral decay, weaving personal reflections with a broader critique of imperialism, corruption, and exploitation. Through its narrative, it challenges the reader to confront the uncomfortable truths about colonialism and the human cost of profit-driven industries.",
    "price": 1324,
    "category": "Fiction",
    "author": "Multatuli Multatuli",
    "quantity": 21,
    "image": "https://books.google.com/books/content?id=Wc9f0QEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "Wc9f0QEACAAJ",
    "createdAt": "2025-08-27T17:28:38.756Z",
    "updatedAt": "2025-08-27T17:28:38.756Z"
  },
  {
    "id": "8de76ef2-3b42-43bc-9a1f-e4d8b5411e57",
    "name": "The Return of the Soldier",
    "description": "Writing her first novel during World War I, West examines the relationship between three women and a soldier suffering from shell-shock. This novel of an enclosed world invaded by public events also embodies in its characters the shifts in England's class structures at the beginning of the twentieth century. For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
    "price": 1109,
    "category": "Fiction",
    "author": "Rebecca West",
    "quantity": 5,
    "image": "https://books.google.com/books/content?id=Wx3M_7XNTysC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "Wx3M_7XNTysC",
    "createdAt": "2025-08-27T17:28:38.756Z",
    "updatedAt": "2025-08-27T17:28:38.756Z"
  },
  {
    "id": "b6800fde-ee47-489c-ae5a-1733672c126a",
    "name": "Taras Bulba",
    "description": "Feroces, crueles, valientes y apasionados, los cosacos hacen temblar la estepa bajo los cascos de sus caballos. Y entre ellos se encuentra Taras Bulba, un anciano lleno aún de fuerza e inteligencia que junto a sus hijos, Ostap y Andrí, avanzará por tierras polacas con intención de vengar su fe ortodoxa burlada por los católicos. Ninguna guarnición, ciudad amurallada o iglesia podrán detenerlos, hasta que la desgracia se cierna sobre ellos y el apuesto y enamoradizo Andrí haga que su padre maldiga el día en que lo engendró. Taras Bulba, una anomalía entre la obra más conocida de Gogol, es una aventura trepidante, una sinfonía en perpetuo crescendo, en la que cada capítulo es más intenso y sorprendente que el anterior. un fresco tan afinadamente dibujado y tan vívido que resulta absolutamente intemporal.",
    "price": 743,
    "category": "Literary Criticism",
    "author": "Nikolái V. Gogol",
    "quantity": 22,
    "image": "https://books.google.com/books/content?id=XdMBTKWSfeMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "XdMBTKWSfeMC",
    "createdAt": "2025-08-27T17:28:38.756Z",
    "updatedAt": "2025-08-27T17:28:38.756Z"
  },
  {
    "id": "747942aa-38ee-408e-bbc7-51fcee943d53",
    "name": "The Pickwick Papers",
    "description": "The Pickwick PapersThe Posthumous Papers of the Pickwick Club The Posthumous Papers of the Pickwick Club (also known as The Pickwick Papers) was Charles Dickens's first novel. He was asked to contribute to the project as an up-and-coming writer following the success of Sketches by Boz, published in 1836 (most of Dickens' novels were issued in shilling instalments before being published as complete volumes). Dickens (still writing under the pseudonym of Boz) increasingly took over the unsuccessful monthly publication after the original illustrator Robert Seymour had committed suicide. With the introduction of Sam Weller in chapter 10, the book became the first real publishing phenomenon, with bootleg copies, theatrical performances, Sam Weller joke books, and other merchandise. After the publication, the widow of Robert Seymour claimed that the idea for the novel was originally her husband's however, in his preface to the 1867 edition, Dickens strenuously denied any specific input, writing that \"Mr Seymour never originated or suggested an incident, a phrase, or a word, to be found in the book.\"Editorial ReviewsReviewCharles Dickens' first novel, The Pickwick Papers was first published in 1836.Samuel Pickwick is the founder and perpetual president of the Pickwick Club. He and his fellow Pickwickians travel to the far-flung corners of London in search of adventure - luckily for the gentlemen, amusement and hilarity are never in short supply. Along their way, they encounter plenty of characters - from villains who land them in deep trouble to one woman who sues Pickwick to force him into marriage, providing the Pickwickians with plenty of tales to entertain.",
    "price": 382,
    "category": "Fiction",
    "author": "Charles Dickens",
    "quantity": 10,
    "image": "https://books.google.com/books/content?id=ZC8czgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "ZC8czgEACAAJ",
    "createdAt": "2025-08-27T17:28:38.756Z",
    "updatedAt": "2025-08-27T17:28:38.756Z"
  },
  {
    "id": "adf5dcac-40e0-4482-a842-f5a625d924da",
    "name": "Jacob's Room",
    "description": "A Nonconformist Novel with No Central Character “Either we are men, or we are women. Either we are cold, or we are sentimental. Either we are young, or growing old. In any case life is but a procession of shadows, and God knows why it is that we embrace them so eagerly, and see them depart with such anguish, being shadows.” - Virginia Woolf, Jacob's Room Jacob’s Room is not your typical Victorian English novel. The fact that there is no real protagonist stands out the most. Jacob is not actually a character, only a collection of memories, feelings and sensations. His life is like a room seen through the eyes of other people. This Xist Classics edition has been professionally formatted for e-readers with a linked table of contents. This eBook also contains a bonus book club leadership guide and discussion questions. We hope you’ll share this book with your friends, neighbors and colleagues and can’t wait to hear what you have to say about it.",
    "price": 155.61,
    "category": "Fiction",
    "author": "Virgina Woolf",
    "quantity": 5,
    "image": "https://books.google.com/books/content?id=a98mCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "a98mCwAAQBAJ",
    "createdAt": "2025-08-27T17:28:38.756Z",
    "updatedAt": "2025-08-27T17:28:38.756Z"
  },
  {
    "id": "9b5d2c61-1cdf-4b8a-8052-fe1d435186a3",
    "name": "Difficult Loves",
    "description": "The author of Invisible Cities explores love and war \"with enormous realist dignity\" in this collection of \" wondrous work from [his] early career\" ( Kirkus, starred review). In this short story collection, one of Italy's greatest storytellers explores the interior lives of characters just as their most cherished illusions of love are suddenly swept away. A soldier is reduced to quivering fear by the presence of a full-figured woman in his train compartment; a young clerk leaves a lady's bed at dawn; a young woman is isolated from bathers on a beach by the loss of her bikini bottom. Confronted with a jarring moment of recognition, each of these characters discovers hidden truths beneath the surface of everyday life. This is the first edition in English to present these fifteen short stories together as Calvino originally envisioned them. It also includes two stories newly translated by Ann Goldstein.",
    "price": 1388.47,
    "category": "Fiction",
    "author": "Italo Calvino",
    "quantity": 9,
    "image": "https://books.google.com/books/content?id=aLPqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "aLPqDwAAQBAJ",
    "createdAt": "2025-08-27T17:28:38.756Z",
    "updatedAt": "2025-08-27T17:28:38.756Z"
  },
  {
    "id": "c7511cd6-a82d-4a8e-a55d-eeb01fa0e314",
    "name": "THE Murder Of Roger Ackroyd",
    "description": "Considered to be one of Agatha Christie's greatest, and also most controversial mysteries, 'The Murder Of Roger Ackroyd' breaks the rules of traditional mystery. The peaceful English village of King’s Abbot is stunned. The widow Ferrars dies from an overdose of Veronal. Not twenty-four hours later, Roger Ackroyd—the man she had planned to marry—is murdered. It is a baffling case involving blackmail and death that taxes Hercule Poirot’s “little grey cells” before he reaches one of the most startling conclusions of his career. Librarian's note: the first fifteen novels in the Hercule Poirot series are 1) The Mysterious Affair at Styles, 1920; 2) The Murder on the Links, 1923; 3) The Murder of Roger Ackroyd, 1926; 4) The Big Four, 1927; 5) The Mystery of the Blue Train, 1928; 6) Peril at End House, 1932; 7) Lord Edgware Dies, 1933; 8) Murder on the Orient Express, 1934; 9) Three Act Tragedy, 1935; 10) Death in the Clouds, 1935; 11) The A.B.C. Murders, 1936; 12) Murder in Mesopotamia, 1936; 13) Cards on the Table, 1936; 14) Dumb Witness, 1937; and 15) Death on the Nile, 1937. These are just the novels; Poirot also appears in this period in a play, Black Coffee, 1930, and two collections of short stories, Poirot Investigates, 1924, and Murder in the Mews, 1937. Each novel, play and short story has its own entry on Goodreads.",
    "price": 322.5,
    "category": "Fiction",
    "author": "AGATHA CHRISTIE",
    "quantity": 24,
    "image": "https://books.google.com/books/content?id=fP33EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "fP33EAAAQBAJ",
    "createdAt": "2025-08-27T17:28:38.756Z",
    "updatedAt": "2025-08-27T17:28:38.756Z"
  },
  {
    "id": "e27a212e-e163-4c87-a1f7-7197de3960f2",
    "name": "Journey to the Center of the Earth",
    "description": "The intrepid Professor Lindenbrock embarks upon the strangest expedition of the nineteenth century: a journey down an extinct Icelandic volcano to the Earth’s very core. In his quest to penetrate the planet’s primordial secrets, the geologist—together with his quaking nephew Axel and their devoted guide, Hans—discovers an astonishing subterranean menagerie of prehistoric proportions. Verne’s imaginative tale is at once the ultimate science fiction adventure and a reflection on the perfectibility of human understanding and the psychology of the questor. As David Brin notes in his Introduction, though Verne never knew the term “science fiction,” Journey to the Centre of the Earth is “inarguably one of the wellsprings from which it all began.”",
    "price": 193.73,
    "category": "Fiction",
    "author": "Jules Verne",
    "quantity": 15,
    "image": "https://books.google.com/books/content?id=icKmd-tlvPMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "icKmd-tlvPMC",
    "createdAt": "2025-08-27T17:28:38.756Z",
    "updatedAt": "2025-08-27T17:28:38.756Z"
  },
  {
    "id": "c397f6c0-ea0a-4b98-9f34-6d1975319ceb",
    "name": "The Prophet",
    "description": "A 20th century classic, The Prophet is thought-provoking, comforting and wise, and its simple truths remain compelling and rewarding to this day. Utterly unique and beloved around the world, The Prophet is a collection of twenty-six poetic essays by the Lebanese artist, philosopher and writer Kahlil Gibran. Telling the story of the prophet Al-Mustafa and his conversations with various acquaintances as he returns home after a long absence, the book touches on subjects of universal concern, including love, friendship, passion, pain, religion and freedom.",
    "price": 213.9,
    "category": "Fiction",
    "author": "Kahlil Gibran",
    "quantity": 10,
    "image": "https://books.google.com/books/content?id=nAYBEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "nAYBEAAAQBAJ",
    "createdAt": "2025-08-27T17:28:38.756Z",
    "updatedAt": "2025-08-27T17:28:38.756Z"
  },
  {
    "id": "37320af0-cf82-4cdd-8027-9f9fa5c39a8e",
    "name": "There There",
    "description": "PULITZER PRIZE FINALIST • NATIONAL BESTSELLER • A wondrous and shattering award-winning novel that follows twelve characters from Native communities: all traveling to the Big Oakland Powwow, all connected to one another in ways they may not yet realize. A contemporary classic, this “astonishing literary debut” (Margaret Atwood, bestselling author of The Handmaid’s Tale) “places Native American voices front and center” (NPR/Fresh Air). One of The Atlantic’s Great American Novels of the Past 100 Years Among them is Jacquie Red Feather, newly sober and trying to make it back to the family she left behind. Dene Oxendene, pulling his life together after his uncle’s death and working at the powwow to honor his memory. Fourteen-year-old Orvil, coming to perform traditional dance for the very first time. They converge and collide on one fateful day at the Big Oakland Powwow and together this chorus of voices tells of the plight of the urban Native American—grappling with a complex and painful history, with an inheritance of beauty and spirituality, with communion and sacrifice and heroism A book with “so much jangling energy and brings so much news from a distinct corner of American life that it’s a revelation” (The New York Times). It is fierce, funny, suspenseful, and impossible to put down--full of poetry and rage, exploding onto the page with urgency and force. There There is at once poignant and unflinching, utterly contemporary and truly unforgettable. Don't miss Tommy Orange's new book, Wandering Stars!",
    "price": 1308,
    "category": "Fiction",
    "author": "Tommy Orange",
    "quantity": 12,
    "image": "https://books.google.com/books/content?id=oNY0DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "oNY0DwAAQBAJ",
    "createdAt": "2025-08-27T17:28:38.756Z",
    "updatedAt": "2025-08-27T17:28:38.756Z"
  },
  {
    "id": "dd0931a9-50b8-4a19-a0fd-3b301fa56bf7",
    "name": "The Street of Crocodiles",
    "description": "''The Street of Crocodiles'' by Bruno Schulz (1892-1942) was first published in Polish in 1934; this English translation was first published in the US by Walker and Company in 1963, public domain. A novel that blends the real and the fantastic, from \"one of the most original imaginations in modern Europe\" (Cynthia Ozick). The Street of Crocodiles in the Polish city of Drogobych is a street of memories and dreams where recollections of Bruno Schulz's uncommon boyhood and of the eerie side of his merchant family's life are evoked in a startling blend of the real and the fantastic. Most memorable - and most chilling - is the portrait of the author's father, a maddened shopkeeper who imports rare birds' eggs to hatch in his attic, who believes tailors' dummies should be treated like people, and whose obsessive fear of cockroaches causes him to resemble one. Bruno Schulz, a Polish Jew killed by the Nazis in 1942, is considered by many to have been the leading Polish writer between the two world wars.",
    "price": 740,
    "category": "Fiction",
    "author": "Bruno Schulz",
    "quantity": 12,
    "image": "https://books.google.com/books/content?id=v7VPEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "v7VPEQAAQBAJ",
    "createdAt": "2025-08-27T17:28:38.756Z",
    "updatedAt": "2025-08-27T17:28:38.756Z"
  },
  {
    "id": "048753e5-ad34-40e9-ba3d-13f1fb0a7cb6",
    "name": "The Picture of Dorian Gray Illustrated",
    "description": "The Picture of Dorian Gray is a Gothic and philosophical novel by Oscar Wilde, first published complete in the July 1890 issue of Lippincott's Monthly Magazine.Fearing the story was indecent, the magazine's editor deleted roughly five hundred words before publication without Wilde's knowledge. Despite that censorship, The Picture of Dorian Gray offended the moral sensibilities of British book reviewers, some of whom said that Oscar Wilde merited prosecution for violating the laws guarding public morality. In response, Wilde aggressively defended his novel and art in correspondence with the British press, although he personally made excisions of some of the most controversial material when revising and lengthening the story for book publication the following year.",
    "price": 1236,
    "category": "Books",
    "author": "Oscar Wilde",
    "quantity": 18,
    "image": "https://books.google.com/books/content?id=xwSWzQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "xwSWzQEACAAJ",
    "createdAt": "2025-08-27T17:28:38.756Z",
    "updatedAt": "2025-08-27T17:28:38.756Z"
  },
  {
    "id": "eb57de2f-3cea-41f8-97a8-aff7f3a54f6a",
    "name": "How to Stop Time",
    "description": "From the New York Times bestselling author of The Midnight Library. “A quirky romcom dusted with philosophical observations….A delightfully witty…poignant novel.” —The Washington Post “She smiled a soft, troubled smile and I felt the whole world slipping away, and I wanted to slip with it, to go wherever she was going… I had existed whole years without her, but that was all it had been. An existence. A book with no words.” Tom Hazard has just moved back to London, his old home, to settle down and become a high school history teacher. And on his first day at school, he meets a captivating French teacher at his school who seems fascinated by him. But Tom has a dangerous secret. He may look like an ordinary 41-year-old, but owing to a rare condition, he's been alive for centuries. Tom has lived history--performing with Shakespeare, exploring the high seas with Captain Cook, and sharing cocktails with Fitzgerald. Now, he just wants an ordinary life. Unfortunately for Tom, the Albatross Society, the secretive group which protects people like Tom, has one rule: Never fall in love. As painful memories of his past and the erratic behavior of the Society's watchful leader threaten to derail his new life and romance, the one thing he can't have just happens to be the one thing that might save him. Tom will have to decide once and for all whether to remain stuck in the past, or finally begin living in the present. How to Stop Time tells a love story across the ages—and for the ages—about a man lost in time, the woman who could save him, and the lifetimes it can take to learn how to live. It is a bighearted, wildly original novel about losing and finding yourself, the inevitability of change, and how with enough time to learn, we just might find happiness. Soon to be a major motion picture starring Benedict Cumberbatch.",
    "price": 1264.07,
    "category": "Художественная литература",
    "author": "Matt Haig",
    "quantity": 18,
    "image": "/api/google-books/image-proxy?src=https%3A%2F%2Fbooks.google.com%2Fbooks%2Fcontent%3Fid%3DIn8mDwAAQBAJ%26printsec%3Dfrontcover%26img%3D1%26zoom%3D1%26edge%3Dcurl%26source%3Dgbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "In8mDwAAQBAJ",
    "createdAt": "2025-09-01T11:25:42.325Z",
    "updatedAt": "2025-09-01T11:25:42.325Z"
  },
  {
    "id": "d48cb3da-9b57-437e-8f74-039a38115d11",
    "name": "A Portrait of the Artist as a Young Man",
    "description": "James JoyceÕs 1916 novella A Portrait of the Artist as a Young Man is about the early manhood of Stephen Dedalus, later one of the leading characters in Ulysses. StephenÕs growing self-awareness as an artist forces him to reject the whole narrow world in which he has been brought up, including family ties, nationalism, and the Catholic religion.",
    "price": 685,
    "category": "Художественная литература",
    "author": "James Joyce",
    "quantity": 5,
    "image": "/api/google-books/image-proxy?src=https%3A%2F%2Fbooks.google.com%2Fbooks%2Fcontent%3Fid%3D-sZSDwAAQBAJ%26printsec%3Dfrontcover%26img%3D1%26zoom%3D1%26edge%3Dcurl%26source%3Dgbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "-sZSDwAAQBAJ",
    "createdAt": "2025-09-02T18:15:21.737Z",
    "updatedAt": "2025-09-02T18:15:21.737Z"
  },
  {
    "id": "808ef323-6c04-40cf-a4bb-1f442e8a5f4e",
    "name": "The Trial",
    "description": "The story of the mysterious indictment, trial, and reckoning forced upon Joseph K—one of the twentieth century’s master parables from one of the greatest writers of the twentieth century, the author of The Metamorphosis. Translated by Willa and Edwin Muir The Trial reflects the central spiritual crises of modern life. Kafka’s method—one that has influenced, in some way, almost every writer of substance who followed him—was to render the absurd and the terrifying convincing by a scrupulous, hyperreal matter-of-factness of tone and treatment. He thereby imparted to his work a level of seriousness normally associated with civilization’s most cherished poems and religious texts. Everyman's Library pursues the highest production standards, printing on acid-free cream-colored paper, with full-cloth cases with two-color foil stamping, decorative endpapers, silk ribbon markers, European-style half-round spines, and a full-color illustrated jacket. Contemporary Classics include an introduction, a select bibliography, and a chronology of the author's life and times.",
    "price": 1002,
    "category": "Художественная литература",
    "author": "Franz Kafka",
    "quantity": 16,
    "image": "/api/google-books/image-proxy?src=https%3A%2F%2Fbooks.google.com%2Fbooks%2Fcontent%3Fid%3D8T9_cxH7z6sC%26printsec%3Dfrontcover%26img%3D1%26zoom%3D1%26source%3Dgbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "8T9_cxH7z6sC",
    "createdAt": "2025-09-02T18:15:21.737Z",
    "updatedAt": "2025-09-02T18:15:21.737Z"
  },
  {
    "id": "4d416dfe-1ac9-4837-b679-dc7bf7f524aa",
    "name": "«Преступление и наказание»",
    "description": "Жил был один пацан",
    "price": 900,
    "category": "художественное",
    "author": "Фёдора Михайловича Достоевского",
    "quantity": 3,
    "image": "https://basket-23.wbbasket.ru/vol3960/part396059/396059070/images/big/1.webp",
    "ownerId": "7kWODYao9oSk8abgZWiXAJyWZOc2",
    "source": "local",
    "googleVolumeId": null,
    "createdAt": "2025-09-03T16:22:50.454Z",
    "updatedAt": "2025-09-06T21:50:25.154Z"
  },
  {
    "id": "7bc28be1-50e1-4845-b8bc-37d3ebf2b488",
    "name": "Милая девушка",
    "description": "красивый дом",
    "price": 435,
    "category": "учебное",
    "author": "Гамлет",
    "quantity": 1,
    "image": "",
    "ownerId": "7kWODYao9oSk8abgZWiXAJyWZOc2",
    "source": "local",
    "googleVolumeId": null,
    "createdAt": "2025-09-03T17:35:54.933Z",
    "updatedAt": "2025-09-03T17:35:54.933Z"
  },
  {
    "id": "cb10d24c-c84b-4602-a4c8-1693d11a954a",
    "name": "«Бесы»",
    "description": "Достоевский написал роман под впечатлением от ростков террористического и радикального движений в среде русских интеллигентов, разночинцев. Прообразом сюжета стало дело 1869 года об убийстве студента Ивана Иванова членами одного из революционных кружков во главе с нигилистом Сергеем Нечаевым.",
    "price": 780,
    "category": "художественное",
    "author": "Фёдор Михайлович Достоевский",
    "quantity": 3,
    "image": "https://i.pinimg.com/736x/90/3d/31/903d31a2df8bee9722e3ca4aacd490b0.jpg",
    "ownerId": "7kWODYao9oSk8abgZWiXAJyWZOc2",
    "source": "local",
    "googleVolumeId": null,
    "createdAt": "2025-09-04T12:27:10.560Z",
    "updatedAt": "2025-09-06T21:51:40.096Z"
  },
  {
    "id": "d343411c-1401-43ab-8a50-6e8828995827",
    "name": "The Final Problem",
    "description": "In \"The Final Problem\", Sherlock Holmes finds himself locked in a dangerous battle of wits against Professor Moriarty, the mastermind behind London's criminal underworld. Aware of the growing threat, Holmes and Watson flee to Switzerland in an attempt to evade Moriarty's reach. As the pursuit intensifies, Holmes devises a plan to end Moriarty's influence once and for all, leading to a fateful confrontation at the Reichenbach Falls.",
    "price": 59,
    "category": "Художественная литература",
    "author": "Arthur Conan Doyle",
    "quantity": 22,
    "image": "/api/google-books/image-proxy?src=https%3A%2F%2Fbooks.google.com%2Fbooks%2Fcontent%3Fid%3DXUtNEQAAQBAJ%26printsec%3Dfrontcover%26img%3D1%26zoom%3D1%26edge%3Dcurl%26source%3Dgbs_api",
    "ownerId": "google-seed",
    "source": "google",
    "googleVolumeId": "XUtNEQAAQBAJ",
    "createdAt": "2025-09-05T15:13:11.724Z",
    "updatedAt": "2025-09-05T15:13:11.724Z"
  }
]